Revit 2026 API

# SchemaBuilderSetSchemaName Method

---

Sets the name of the Schema.

**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SchemaBuilder SetSchemaName(
	string schemaName
)
```
```vb
Public Function SetSchemaName (
	schemaName As String
) As SchemaBuilder
```
```cpp
public:
SchemaBuilder^ SetSchemaName(
	String^ schemaName
)
```
```fsharp
member SetSchemaName :
        schemaName : string -> SchemaBuilder
```

#### Parameters

schemaName String
     The name for the Schema.

#### Return Value

SchemaBuilder The SchemaBuilder object may be used to add more settings.

| Exception | Condition |
| --- | --- |
| ArgumentException | The parameter schemaName is not acceptable for naming Extensible Storage objects. |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | The SchemaBuilder has already finished building the Schema. |

The name is a user-friendly identifier of the Schema. GUIDs are used exclusively for Schema identity, but the name is useful to identify the Schema during development or in an error message. This field is required.

#### Reference

SchemaBuilder Class

Autodesk.Revit.DB.ExtensibleStorage Namespace